<?php
return [
  'pay_method' => [
      'online'=>'무통장 입금',
      'card'=>'신용카드',
  ],
  'pay_status' => [
      '0'=>'결제대기',
      '10'=>'결제완료',
      '20'=>'결제취소',
  ],
  'delivery_status' => [
    '0' => '주문', // 결제대기  <!-- user
    '10' => '결제완료',// 상품준비 <!- manager
    // '20' => '상품준비',
    '30' => '배송중',
    '40' => '배송완료',
    '50' => '주문취소요청',
    '59' => '주문취소완료',
    // '60' => '반품요청',
    // '69' => '반품완료',
    // '70' => '교환요청',
    // '79' => '교환완료',
    '100' => '거래완료'// (배송수취확인)'
  ],
  'exchange_status' => [ // 30, 60, 80 일경우 모든 주문이 완료
    '0' => '접수신청', // 결제대기
    '10' => '거절',// 상품준비
    '20' => '교환진행중',
    '90' => '교환완료'
  ],
  'refund_status' => [ // 30, 60, 80 일경우 모든 주문이 완료
    '0' => '접수신청', // 결제대기
    '10' => '거절',// 상품준비
    '20' => '반품진행중',
    '90' => '반품완료'
  ],
  'pay_status' => [
    '0'=>'지불대기',
    '10'=>'지불완료',
    '20'=>'결제취소'
  ],

  'coupon' => [
    'apply_type' => [
      'all'=>'전체상품',
      'product'=>'상품별',
      'category'=>'카테고리별'
    ],
    'apply_amount_type' => [
      'price'=>'금액',
      'percentage'=>'할인율',
    ]

  ],
];
